---
kind: method
id: M:Autodesk.Revit.DB.ElementArray.Append(Autodesk.Revit.DB.Element)
source: html/954808b1-1a9c-ad39-50a9-0afae78b88d3.htm
---
# Autodesk.Revit.DB.ElementArray.Append Method

Add the element to the end of the array.

## Syntax (C#)
```csharp
public virtual void Append(
	Element item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Element`) - The element to be added.